
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 2 to change, 2 to destroy.</code></pre>

* Update
  * module.evidenceshare-topic.azurerm_servicebus_topic.servicebus_topic
  * module.sscs-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * module.evidenceshare-subscription.azurerm_servicebus_subscription.servicebus_subscription
  * module.notifications-subscription.azurerm_servicebus_subscription.servicebus_subscription


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.evidenceshare-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_servicebus_topic" "this"  {
      ~ auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ default_message_ttl                     = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ duplicate_detection_history_time_window = "PT1H" -> (known after apply)
      ~ enable_batched_operations               = false -> (known after apply)
      ~ enable_express                          = false -> (known after apply)
      ~ enable_partitioning                     = false -> (known after apply)
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-evidenceshare-topic-aat" -> (known after apply)
      ~ max_size_in_megabytes                   = 2048 -> (known after apply)
        name                                    = "sscs-evidenceshare-topic-aat"
      ~ requires_duplicate_detection            = true -> (known after apply)
      ~ status                                  = "Active" -> (known after apply)
      ~ support_ordering                        = false -> (known after apply)
        # (2 unchanged attributes hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.evidenceshare-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ id                                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-evidenceshare-topic-aat/subscriptions/sscs-evidenceshare-subscription-aat" -> (known after apply)
        name                                      = "sscs-evidenceshare-subscription-aat"
      ~ topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-evidenceshare-topic-aat" -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.evidenceshare-topic.azurerm_servicebus_topic.servicebus_topic will be updated in-place
  ~ resource "azurerm_servicebus_topic" "servicebus_topic" {
      ~ duplicate_detection_history_time_window = "PT1H" -> "PT60M"
        id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-evidenceshare-topic-aat"
        name                                    = "sscs-evidenceshare-topic-aat"
        # (11 unchanged attributes hidden)
    }

  # module.notifications-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_servicebus_topic" "this"  {
      ~ auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ default_message_ttl                     = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ duplicate_detection_history_time_window = "PT1H" -> (known after apply)
      ~ enable_batched_operations               = false -> (known after apply)
      ~ enable_express                          = false -> (known after apply)
      ~ enable_partitioning                     = false -> (known after apply)
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-evidenceshare-topic-aat" -> (known after apply)
      ~ max_size_in_megabytes                   = 2048 -> (known after apply)
        name                                    = "sscs-evidenceshare-topic-aat"
      ~ requires_duplicate_detection            = true -> (known after apply)
      ~ status                                  = "Active" -> (known after apply)
      ~ support_ordering                        = false -> (known after apply)
        # (2 unchanged attributes hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.notifications-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ id                                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-evidenceshare-topic-aat/subscriptions/sscs-notifications-subscription-aat" -> (known after apply)
        name                                      = "sscs-notifications-subscription-aat"
      ~ topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-evidenceshare-topic-aat" -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.sscs-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat|sscs-aat"
        name                       = "sscs-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
        # (1 unchanged block hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.sscs-vault.azurerm_monitor_diagnostic_setting.kv-ds has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat|sscs-aat"
        name                       = "sscs-aat"
        # (2 unchanged attributes hidden)

      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":139,"Program":"tfcmt","SHA1":"","Vars":{}} -->